#+BEGIN_EXPORT html
---
layout: post
title: Go programming
tagline: " not a monstrous task at all"
permalink: /go/emacs/ide/chromebook-hp-14a-0060nr.html
categories: [GoLang, IDE, Emacs, Chromebook]
tags: [tutorial, ide, chromebook]
---
#+END_EXPORT

#+STARTUP: showall
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 2
#+PROPERTY:header-args :results output :exports both :eval no-export
* Useful links
* Go installation on Buster

  By default your Chromebook runs Linux container with Debian
  Buster. In assumption thay you are already a proficient Debian user
  it might be easy-peasy to install Golang from the official
  repository:
  #+BEGIN_SRC sh
  sudo apt-get install golang
  #+END_SRC

  Lets check up Golang version to ensure the success of your
  installation:
  #+BEGIN_SRC sh
  go version
  #+END_SRC

  #+RESULTS:
  : go version go1.11.6 linux/amd64

* Babel configuration

  Org-mode inside emacs propose you to write the /alive code
  snippets/, freely launch it and get its output in one single
  place. It is a core idea of literate programming. By default
  Org-mode does not prepared to digest Golang. Lets configure your
  Emacs editor to cope with Golang code snippets:
  #+BEGIN_SRC elisp
    package-install ob-go
    package-install go-mode
  #+END_SRC
* Default conventions

  By default:
  - if you don't define function name it is =main=;
  - you should manually define neccessary imports in the snippet's
    header.

* The primitive sample

  With intention to test up how it works lets compose the trivial
  sample and launch it by typing =C-c C-c=:
  #+begin_src go :imports "fmt"
    fmt.Println("Hello, 世界")
  #+end_src

  #+RESULTS:
  : Hello, 世界

  Here we implemented the strict output by =Println= function out from
  =fmt= module.

* Assignment operator and variable value substitution

  In most cases it is necessary to use ~variables~ - a special form of
  named entities, wich should be named in a special manner and
  properly defined.

** Name conventions

   The proper variable name (identifier) in Golang should begin with a
   letter or underscore, and have no spaces inside it:

   #+begin_quote
   a
   _x9
   ThisVariableIsExported
   αβ
   #+end_quote

   *AND NOT A RESERVED KEYWORD*

   #+begin_quote
   break        default      func         interface    select
   case         defer        go           map          struct
   chan         else         goto         package      switch
   const        fallthrough  if           range        type
   continue     for          import       return       var
   #+end_quote

* Functions and Scope

  #+begin_src go :imports "fmt"
    func main() {
    fmt.Printf("My number is: %d\n", triple_add(2, 3, 4))
    }
    func triple_add(a, b, c int) int{
    return a + b + c
    }
  #+end_src

  #+RESULTS:
  : My number is: 9

